/*---------------------------------------------------------*
 example2_02_method1：两种符号常量定义的区别,方法1,用宏定义
*----------------------------------------------------------*/

#include<iostream>
using namespace std;

int main()
{
    int x = 5;

#define T1 x+x                //define T1

#define T2 T1-T1              //define T2

    cout<< "T1 = " << T1 << "   T2 = " << T2 <<endl;

    return 0;
}

/*---------------------------------------------------*
T1 :   x+x = 5+5 =10
T2 :   T1-T1 = x+x - x+x = x+x = 10
*----------------------------------------------------*/
